### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [2]:
import pandas as pd
import numpy as np

In [3]:
mylist = list('abcedfghijklmnopqrstuvwxyz')

In [4]:
myarr = np.arange(26)

In [5]:
mydict=pd.DataFrame(myarr,mylist)

In [6]:
mydict

    0
a   0
b   1
c   2
e   3
d   4
f   5
g   6
h   7
i   8
j   9
k  10
l  11
m  12
n  13
o  14
p  15
q  16
r  17
s  18
t  19
u  20
v  21
w  22
x  23
y  24
z  25

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [7]:
## your output should look like this.

In [8]:
import pandas as pd
import numpy as np

In [9]:
np.take(list('abcdefgh'), np.random.randint(8, size=30))

array(['a', 'g', 'h', 'c', 'e', 'c', 'g', 'g', 'b', 'e', 'f', 'h', 'g',
       'e', 'f', 'f', 'c', 'a', 'b', 'f', 'c', 'b', 'a', 'g', 'g', 'b',
       'c', 'f', 'c', 'g'], dtype='<U1')

In [10]:
pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

0     e
1     f
2     c
3     e
4     g
5     a
6     g
7     a
8     h
9     f
10    g
11    a
12    e
13    f
14    b
15    b
16    f
17    b
18    b
19    a
20    f
21    c
22    f
23    e
24    f
25    d
26    a
27    e
28    a
29    c
dtype: object

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [11]:
# just write that parameter name here

In [12]:
pd.read_csv(r"C:\Users\Akashdeep\iris.csv",usecols=['sepal_length','sepal_width'])

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [13]:
# read fruits.csv file

### Q4. Get mean, median, max , min price for each fruit .

In [14]:
# Your output should look like this

In [15]:
df=pd.read_csv('fruits.csv')

In [16]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [17]:
h = df.groupby('Fruit Name')['Price']

In [18]:
h.agg(['min','max','mean','median'])

            min  max        mean  median
Fruit Name
Banana       85  112   98.500000    98.5
Mango        60  160  106.666667   100.0
PineApple    90  285  187.500000   187.5
Strawberry  200  200  200.000000   200.0

In [19]:
h.min()

Fruit Name
Banana         85
Mango          60
PineApple      90
Strawberry    200
Name: Price, dtype: int64

In [20]:
h.mean()

Fruit Name
Banana         98.500000
Mango         106.666667
PineApple     187.500000
Strawberry    200.000000
Name: Price, dtype: float64

In [21]:
h.median()

Fruit Name
Banana         98.5
Mango         100.0
PineApple     187.5
Strawberry    200.0
Name: Price, dtype: float64

In [22]:
h.max()

Fruit Name
Banana        112
Mango         160
PineApple     285
Strawberry    200
Name: Price, dtype: int64

### Q5. What is the total cost of this basket?

In [23]:
#your output should be this

In [24]:
print("Total Cost",df.Price.sum())

Total Cost 1092

### Q6. Which fruit has the maximum price per quantity?

In [59]:
df=pd.read_csv('fruits.csv')

In [60]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [61]:
df['Price\Quantity']=df['Price']/df['Quantity']

In [62]:
df

   Fruit Name  Quantity  Price  Price\Quantity
0      Banana        78    112        1.435897
1       Mango        40    160        4.000000
2      Banana        20     85        4.250000
3   PineApple        15     90        6.000000
4  Strawberry       100    200        2.000000
5       Mango        25     60        2.400000
6       Mango        40    100        2.500000
7   PineApple        50    285        5.700000

In [67]:
df.sort_values("Price\Quantity", ascending=False).iloc[0]['Fruit Name']

'PineApple'

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [27]:
#your output should be like this and should have 20 records in total

In [28]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]

In [29]:
pd.get_dummies(arr)

    0  1  2  3  4  5  6
0   1  0  0  0  0  0  0
1   0  1  0  0  0  0  0
2   1  0  0  0  0  0  0
3   0  1  0  0  0  0  0
4   1  0  0  0  0  0  0
5   0  0  1  0  0  0  0
6   0  0  0  1  0  0  0
7   0  0  0  0  0  0  1
8   0  0  0  0  0  1  0
9   1  0  0  0  0  0  0
10  1  0  0  0  0  0  0
11  1  0  0  0  0  0  0
12  0  0  0  0  1  0  0
13  0  1  0  0  0  0  0
14  0  0  1  0  0  0  0
15  0  0  0  1  0  0  0
16  0  0  0  0  0  1  0
17  0  0  0  0  0  1  0
18  0  0  0  0  1  0  0
19  0  0  0  0  1  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [30]:
#your output should be like this

In [31]:
d = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [32]:
df=pd.DataFrame(d)

In [33]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [34]:
df.isnull().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [35]:
#your output should be like this 
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [36]:
import pandas as pd
import numpy as np
df = df.fillna(df.mean())

In [37]:
df

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [38]:
#your output should be like this

In [39]:
df=pd.read_csv('fruits.csv')

In [40]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [41]:
df['Price\Quantity']=df['Price']/df['Quantity']

In [42]:
df

   Fruit Name  Quantity  Price  Price\Quantity
0      Banana        78    112        1.435897
1       Mango        40    160        4.000000
2      Banana        20     85        4.250000
3   PineApple        15     90        6.000000
4  Strawberry       100    200        2.000000
5       Mango        25     60        2.400000
6       Mango        40    100        2.500000
7   PineApple        50    285        5.700000

In [43]:
df.reset_index()

   index  Fruit Name  Quantity  Price  Price\Quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [44]:
#your output should be like this

In [45]:
df=pd.read_csv('sample_sheet_1.csv')

In [46]:
df

  Location Population  House_count Location Area
0      ABB   2.5 lakh          763    25 hectare
1      ABC   1.5 lakh          520    20 hectare
2      CDD   3.5 lakh          800    35 hectare

In [47]:
new_df= pd.read_csv('sample_sheet_2.csv')

In [48]:
new_df

  Location  No. of shops Weekly market day
0      ABB           150   Nothing as such
1      ABC           120           Tuesday
2      CDD           180         Wednesday

In [49]:
pd.concat((df,new_df),axis=1)

,Location,Population,House_count,Location Area,Location,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,ABB,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,ABC,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,CDD,180,Wednesday